<template>
  <div class="catalog filter_box">
    <div class="line_grey arrow catalog_top"
    :class="{arrow_active: catalog}"
    @click="$emit('catalog')">Каталог</div>
    <div class="catalog_bottom"
    :class="{catalog_bottom_active: catalog}">
        <div class="filter_body"
        v-show="catalog"
        :class="{filter_body_active: catalog}">
          <div class="catalog_item"
          v-for="item in catalogList" :key="item.title">
            <div class="catalog_item_top arrow"
            :class="{catalog_item_top_active: item.childActive}"
            @click="changeChildActive(item)">
              <img :src="require(`../assets/svg/catalog/${item.img}.svg`)" alt="">
              <div class="catalog_text">{{ item.title }}</div>
            </div>
            <div class="catalog_item_bottom"
            :class="{catalog_item_bottom_active: item.childActive}">
              <div class="catalog_child" v-for="child in item.child" :key="child.id"
              @click="catalogValue = child.id; closeMobile()"
              :class="{'catalog_child_active': child.id === catalogValue}">
                <input :id='child.id' type="radio" name="catalog" :value="child.id"
                hidden class="catalog_child" v-model="catalogValue" @click.stop>
                <label :for="child.id">{{child.name}}</label>
              </div>
            </div>
          </div>
        </div>
    </div>
  </div>
</template>

<script>
export default {
  props: ['catalog'],
  data() {
    return {
      arrowCatalog: false,
      catalogValue: null,
      catalogList: {
        woman: {
          title: 'Женская одежда',
          img: 't-shirt-2-line',
          childActive: false,
          child: [
            {
              name: 'Блузки и рубашки',
              id: 1,
            },
            {
              name: 'Боди',
              id: 2,
            },
            {
              name: 'Брюки',
              id: 3,
            },
            {
              name: 'Верхняя одежда',
              id: 4,
            },
            {
              name: 'Джемперы и кардиганы',
              id: 5,
            },
            {
              name: 'Джинсы',
              id: 6,
            },
            {
              name: 'Женские пижамы',
              id: 7,
            },
            {
              name: 'Жилеты',
              id: 8,
            },
            {
              name: 'Комбинезоны',
              id: 9,
            },
            {
              name: 'Комбинезоны c шортами',
              id: 10,
            },
            {
              name: 'Костюмы',
              id: 11,
            },
            {
              name: 'Купальники и пляжная одежда',
              id: 12,
            },
            {
              name: 'Женское нижнее белье',
              id: 13,
            },
            {
              name: 'Женские носки и чулочные изделия',
              id: 14,
            },
            {
              name: 'Пиджаки',
              id: 15,
            },
            {
              name: 'Платья',
              id: 16,
            },
            {
              name: 'Толстовки и свитшоты',
              id: 17,
            },
            {
              name: 'Футболки и топы',
              id: 18,
            },
            {
              name: 'Шорты',
              id: 19,
            },
            {
              name: 'Юбки',
              id: 20,
            },
          ],
        },
        man: {
          title: 'Мужская одежда',
          img: 'shirt-line',
          childActive: false,
          child: [
            {
              name: 'Брюки',
              id: 21,
            },
            {
              name: 'Верхняя одежда',
              id: 22,
            },
            {
              name: 'Джемперы, свитеры и кардиганы',
              id: 23,
            },
            {
              name: 'Джинсы',
              id: 24,
            },
            {
              name: 'Домашняя одежда',
              id: 25,
            },
            {
              name: 'Жилеты',
              id: 26,
            },
            {
              name: 'Костюмы',
              id: 27,
            },
            {
              name: 'Мужское нижнее белье',
              id: 28,
            },
            {
              name: 'Мужские носки',
              id: 29,
            },
            {
              name: 'Пиджаки',
              id: 30,
            },
            {
              name: 'Плавки и пляжные шорты',
              id: 31,
            },
            {
              name: 'Рубашки',
              id: 32,
            },
            {
              name: 'Спортивные костюмы',
              id: 33,
            },
            {
              name: 'Толстовки и свитшоты',
              id: 34,
            },
            {
              name: 'Футболки и поло Шорты',
              id: 35,
            },
          ],
        },
        gsm: {
          title: 'Мобильные телефоны и аксессуары',
          img: 'smartphone-line',
          childActive: false,
          child: [
            {
              name: 'Смартфоны Apple iPhone',
              id: 36,
            },
            {
              name: 'Мобильные телефоны',
              id: 37,
            },
            {
              name: 'Восстановленные телефоны',
              id: 38,
            },
            {
              name: 'Аксессуары для мобильных телефонов',
              id: 39,
            },
            {
              name: 'Запчасти для мобильных телефонов',
              id: 40,
            },
            {
              name: 'Внешние аккумуляторы',
              id: 41,
            },
            {
              name: 'Чехлы для смартфонов',
              id: 42,
            },
            {
              name: 'Сенсорные панели (тачскрин)',
              id: 43,
            },
            {
              name: 'Коммуникационное оборудование',
              id: 44,
            },
            {
              name: 'Рации',
              id: 45,
            },
            {
              name: 'Запчасти и аксессуары для раций',
              id: 46,
            },
          ],
        },
        baby: {
          title: 'Мать и ребёнок',
          img: 'parent-line',
          childActive: false,
          child: [
            {
              name: 'Одежда для малышек',
              id: 47,
            },
            {
              name: 'Одежда для малышей',
              id: 48,
            },
            {
              name: 'Одежда для девочек',
              id: 49,
            },
            {
              name: 'Одежда для мальчиков',
              id: 50,
            },
            {
              name: 'Обувь для детей',
              id: 51,
            },
            {
              name: 'Оборудование и механизмы',
              id: 52,
            },
            {
              name: 'Смена подгузников',
              id: 53,
            },
            {
              name: 'Уход за ребенком',
              id: 54,
            },
            {
              name: 'Детское постельное белье',
              id: 55,
            },
            {
              name: 'Защитная экипировка',
              id: 56,
            },
            {
              name: 'Кормление',
              id: 57,
            },
            {
              name: 'Сочетающаяся одежда для семьи',
              id: 58,
            },
            {
              name: 'Обувь для малышей',
              id: 59,
            },
            {
              name: 'Приучение к туалету',
              id: 60,
            },
            {
              name: 'Беременность и материнство',
              id: 61,
            },
            {
              name: 'Детские сувениры',
              id: 62,
            },
            {
              name: 'Мебель для малышей',
              id: 63,
            },
            {
              name: 'Детское питание',
              id: 64,
            },
            {
              name: 'Аксессуары',
              id: 65,
            },
            {
              name: 'Детская коляска',
              id: 66,
            },
            {
              name: 'Сиденья и аксессуары для авто',
              id: 67,
            },
          ],
        },
        auto: {
          title: 'Автомобили и мотоциклы',
          img: 'car-line',
          childActive: false,
          child: [
            {
              name: 'Автомобили',
              id: 68,
            },
            {
              name: 'Автомобильные фары',
              id: 69,
            },
            {
              name: 'Запчасти для авто',
              id: 70,
            },
            {
              name: 'Автоэлектроника',
              id: 71,
            },
            {
              name: 'Аксессуары для салона',
              id: 72,
            },
            {
              name: 'Инструменты для ремонта авто',
              id: 73,
            },
            {
              name: 'Аксессуары и детали для мотоциклов',
              id: 74,
            },
            {
              name: 'Внешние аксессуары',
              id: 75,
            },
            {
              name: 'Мытье и уход за машиной',
              id: 76,
            },
            {
              name: 'Вездеходы, фургоны, лодки и др. транспорт',
              id: 77,
            },
            {
              name: 'Товары для путешествий и дороги',
              id: 78,
            },
            {
              name: 'Моторное масло',
              id: 79,
            },
            {
              name: 'Диски колёсные',
              id: 80,
            },
            {
              name: 'Шины',
              id: 81,
            },

          ],
        },
        groccery: {
          title: 'Украшния и часы',
          img: 'time-line',
          childActive: false,
          child: [
            {
              name: 'Ювелирные украшения',
              id: 82,
            },
            {
              name: 'Ожерелья и подвески',
              id: 83,
            },
            {
              name: 'Серьги',
              id: 84,
            },
            {
              name: 'Кольца',
              id: 85,
            },
            {
              name: 'Гибкие и жесткие браслеты',
              id: 86,
            },
            {
              name: 'Наборы ювелирных украшений и другое',
              id: 87,
            },
            {
              name: 'Изготовление бус и бижутерии',
              id: 88,
            },
            {
              name: 'Ювелирные изделия на свадьбу и помолвку',
              id: 89,
            },
            {
              name: 'Изготовление ювелирных изделий',
              id: 90,
            },
            {
              name: 'Индивидуальные ювелирные изделия',
              id: 91,
            },
            {
              name: 'Мужские часы',
              id: 92,
            },
            {
              name: 'Женские часы',
              id: 93,
            },
            {
              name: 'Часы для любимого',
              id: 94,
            },
            {
              name: 'Детские часы',
              id: 95,
            },
            {
              name: 'Карманные часы',
              id: 96,
            },
            {
              name: 'Аксессуары для наручных часов',
              id: 97,
            },
            {
              name: 'Женские часы-браслеты',
              id: 98,
            },
          ],
        },
        pc: {
          title: 'Компьютерная и офисная техника',
          img: 'computer-line',
          childActive: false,
          child: [
            {
              name: 'Офисная электроника',
              id: 99,
            },
            {
              name: 'Компьютерная периферия',
              id: 100,
            },
            {
              name: 'Ноутбуки',
              id: 101,
            },
            {
              name: 'Планшеты',
              id: 102,
            },
            {
              name: 'Внутренние накопители',
              id: 103,
            },
            {
              name: 'Компьютерные комплектующие',
              id: 104,
            },
            {
              name: 'Сетевое подключение',
              id: 105,
            },
            {
              name: 'Мыши и клавиатуры',
              id: 106,
            },
            {
              name: 'Аксессуары для планшетов',
              id: 107,
            },
            {
              name: 'Аксессуары для ноутбуков',
              id: 108,
            },
            {
              name: 'Демонстрационные стенды и аксессуары',
              id: 109,
            },
            {
              name: 'Мини ПК',
              id: 110,
            },
            {
              name: 'Промышленные компьютеры и аксессуары',
              id: 111,
            },
            {
              name: 'Десктопы',
              id: 112,
            },
            {
              name: 'Серверы',
              id: 113,
            },
            {
              name: 'Очистители для компьютеров',
              id: 114,
            },
            {
              name: 'Запчасти для ноутбуков',
              id: 115,
            },
            {
              name: 'Запчасти для планшетов',
              id: 116,
            },
            {
              name: 'Офисное ПО',
              id: 117,
            },

          ],
        },
        baggage: {
          title: 'Багаж и сумки',
          img: 'briefcase-3-line',
          childActive: false,
          child: [
            {
              name: 'Женские сумки',
              id: 118,
            },
            {
              name: 'Мужские сумки',
              id: 119,
            },
            {
              name: 'Рюкзаки',
              id: 120,
            },
            {
              name: 'Кошельки',
              id: 121,
            },
            {
              name: 'Сумки для детей',
              id: 122,
            },
            {
              name: 'Багаж и дорожные сумки',
              id: 123,
            },
            {
              name: 'Функциональные сумки',
              id: 124,
            },
            {
              name: 'Кошельки и зажимы для монет',
              id: 125,
            },
            {
              name: 'Детали и аксессуары для сумок',
              id: 126,
            },
          ],
        },
        home: {
          title: 'Дом и сад',
          img: 'plant-line',
          childActive: false,
          child: [
            {
              name: 'Кухня, столовая и бар',
              id: 127,
            },
            {
              name: 'Декор для дома',
              id: 128,
            },
            {
              name: 'Домашний текстиль',
              id: 129,
            },
            {
              name: 'Хобби и рукоделие',
              id: 130,
            },
            {
              name: 'Принадлежности для праздника и вечеринки',
              id: 131,
            },
            {
              name: 'Хранение и организация пространства',
              id: 132,
            },
            {
              name: 'Товары для ванной комнаты',
              id: 133,
            },
            {
              name: 'Домашняя уборка',
              id: 134,
            },
            {
              name: 'Товары для питомцев',
              id: 135,
            },
            {
              name: 'Садовые принадлежности',
              id: 136,
            },
            {
              name: 'Бытовые товары',
              id: 137,
            },
            {
              name: 'Бытовая химия',
              id: 138,
            },
          ],
        },
        electronics: {
          title: 'Электроника',
          img: 'flashlight-line',
          childActive: false,
          child: [
            {
              name: 'Портативная электроника',
              id: 139,
            },
            {
              name: 'Умная электроника',
              id: 140,
            },
            {
              name: 'ТВ, аудио и видеотехника',
              id: 141,
            },
            {
              name: 'Аксессуары и запчасти',
              id: 142,
            },
            {
              name: 'Фото и видеотехника',
              id: 143,
            },
            {
              name: 'Системы нагревания табака и электронные сигареты',
              id: 144,
            },
            {
              name: 'Наушники и гарнитуры',
              id: 145,
            },
            {
              name: 'Носимые устройства',
              id: 146,
            },
            {
              name: 'Игровые приставки и видеоигры',
              id: 147,
            },
            {
              name: 'Экшн-камеры и аксессуары',
              id: 148,
            },
            {
              name: 'Колонки',
              id: 149,
            },
            {
              name: 'Видеокамеры 360° и аксессуары',
              id: 150,
            },
            {
              name: 'Прочие электронные аксессуары',
              id: 151,
            },
            {
              name: 'Устройства VR/AR',
              id: 152,
            },
            {
              name: 'Роботы',
              id: 153,
            },
            {
              name: 'Техника Hi-Fi',
              id: 154,
            },
            {
              name: 'Съёмочное оборудование',
              id: 155,
            },
            {
              name: 'Источники питания',
              id: 156,
            },
          ],
        },
        beauty: {
          title: 'Красота и здоровье',
          img: 'empathize-line',
          childActive: false,
          child: [
            {
              name: 'Инструменты для дизайна ногтей',
              id: 157,
            },
            {
              name: 'Макияж',
              id: 158,
            },
            {
              name: 'Забота о здоровье',
              id: 159,
            },
            {
              name: 'Уход за кожей',
              id: 160,
            },
            {
              name: 'Уход за волосами и укладка',
              id: 161,
            },
            {
              name: 'Бритье и удаление волос',
              id: 162,
            },
            {
              name: 'Интимные товары',
              id: 163,
            },
            {
              name: 'Принадлежности для красоты',
              id: 164,
            },
            {
              name: 'Татуировки и боди-арт',
              id: 165,
            },
            {
              name: 'Ванна и душ',
              id: 166,
            },
            {
              name: 'Духи и дезодоранты',
              id: 167,
            },
            {
              name: 'Гигиена полости рта',
              id: 168,
            },
            {
              name: 'Туалетная бумага',
              id: 169,
            },
            {
              name: 'Инструменты и аксессуары',
              id: 170,
            },
            {
              name: 'Бальзам после бритья',
              id: 171,
            },
            {
              name: 'Инструменты по уходу за кожей',
              id: 172,
            },
            {
              name: 'Косметологическое оборудование',
              id: 173,
            },
          ],
        },
        sport: {
          title: 'Спорт и развлечения',
          img: 'basketball-line',
          childActive: false,
          child: [
            {
              name: 'Спортивная одежда',
              id: 174,
            },
            {
              name: 'Кроссовки',
              id: 175,
            },
            {
              name: 'Велоспорт',
              id: 176,
            },
            {
              name: 'Для рыбалки',
              id: 177,
            },
            {
              name: 'Кемпинг и походы',
              id: 178,
            },
            {
              name: 'Плавание',
              id: 179,
            },
            {
              name: 'Музыкальные инструменты',
              id: 180,
            },
            {
              name: 'Охота',
              id: 181,
            },
            {
              name: 'Фитнес и бодибилдинг',
              id: 182,
            },
            {
              name: 'Водные виды спорта',
              id: 183,
            },
            {
              name: 'Командные виды спорта',
              id: 184,
            },
            {
              name: 'Спортивные ракетки',
              id: 185,
            },
            {
              name: 'Гольф',
              id: 186,
            },
            {
              name: 'Бег',
              id: 187,
            },
            {
              name: 'Стрельба',
              id: 188,
            },
            {
              name: 'Лыжи и сноубординг',
              id: 189,
            },
            {
              name: 'Спортивные аксессуары',
              id: 190,
            },
            {
              name: 'Роликовые коньки, скейтборды и скутеры',
              id: 191,
            },
            {
              name: 'Лошадиные скачки',
              id: 192,
            },
            {
              name: 'Боулинг',
              id: 193,
            },
            {
              name: 'Развлечения',
              id: 194,
            },
            {
              name: 'Разное для спорта и развлечений',
              id: 195,
            },
            {
              name: 'Спортивные сумки',
              id: 196,
            },
          ],
        },
        shoes: {
          title: 'Обувь',
          img: 'footprint-line',
          childActive: false,
          child: [
            {
              name: 'Женская обувь',
              id: 197,
            },
            {
              name: 'Обувь без каблука',
              id: 198,
            },
            {
              name: 'Туфли',
              id: 199,
            },
            {
              name: 'Мужская обувь',
              id: 200,
            },
            {
              name: 'Повседневная обувь',
              id: 201,
            },
            {
              name: 'Кроссовки и кеды',
              id: 202,
            },
            {
              name: 'Сапоги',
              id: 203,
            },
            {
              name: 'Мужские ботинки',
              id: 204,
            },
            {
              name: 'Аксессуары для обуви',
              id: 205,
            },
          ],
        },
        light: {
          title: 'Лампы и освещение',
          img: 'keynote-line',
          childActive: false,
          child: [
            {
              name: 'Лампы и абажуры',
              id: 206,
            },
            {
              name: 'Потолочные лампы и вентиляторы',
              id: 207,
            },
            {
              name: 'Лампочки',
              id: 208,
            },
            {
              name: 'Светодиодная подсветка',
              id: 209,
            },
            {
              name: 'Наружное освещение',
              id: 210,
            },
            {
              name: 'Светодиодные лампы',
              id: 211,
            },
            {
              name: 'Портативное освещение',
              id: 212,
            },
            {
              name: 'Производственное освещение',
              id: 213,
            },
            {
              name: 'Ночники',
              id: 214,
            },
            {
              name: 'Лампы для чтения',
              id: 215,
            },
            {
              name: 'Профессиональное освещение',
              id: 216,
            },
            {
              name: 'Новизна освещения',
              id: 217,
            },
            {
              name: 'Праздничное освещение',
              id: 218,
            },
            {
              name: 'Аксессуары для освещения',
              id: 219,
            },
            {
              name: 'Подшкафные лампы',
              id: 220,
            },
            {
              name: 'Специальное функциональное освещение',
              id: 221,
            },
            {
              name: 'Подсветка туалетного столика',
              id: 222,
            },
          ],
        },
        toys: {
          title: 'Игрушки и хобби',
          img: 'bear-smile-line',
          childActive: false,
          child: [
            {
              name: 'Куклы и плюшевые игрушки',
              id: 223,
            },
            {
              name: 'Игрушки на радиоуправлении',
              id: 224,
            },
            {
              name: 'Классические игрушки',
              id: 225,
            },
            {
              name: 'Обучение и образование',
              id: 226,
            },
            {
              name: 'Активные игры и спорт',
              id: 227,
            },
            {
              name: 'Игровые фигурки и трансформеры',
              id: 228,
            },
            {
              name: 'Моделирование',
              id: 229,
            },
            {
              name: 'Игрушечный транспорт',
              id: 230,
            },
            {
              name: 'Игрушки для новорожденных и малышей',
              id: 231,
            },
            {
              name: 'Электронные игрушки',
              id: 232,
            },
            {
              name: 'Головоломки и игры',
              id: 233,
            },
            {
              name: 'Необычные и прикольные игрушки',
              id: 234,
            },
            {
              name: 'Игрушки для снятия стресса',
              id: 235,
            },
            {
              name: 'Конструкторы',
              id: 236,
            },
            {
              name: 'Детские праздники',
              id: 237,
            },
            {
              name: 'Хобби и коллекционирование',
              id: 238,
            },
            {
              name: 'Высокотехнологичные игрушки',
              id: 239,
            },
            {
              name: 'Рукоделие и творчество',
              id: 240,
            },
            {
              name: 'Мягкие игрушки',
              id: 241,
            },
            {
              name: 'Популярные игрушки',
              id: 242,
            },
            {
              name: 'Ролевые и игровые наборы',
              id: 243,
            },
            {
              name: 'Бассейны и развлечения у воды',
              id: 244,
            },
          ],
        },
        weddings: {
          title: 'Свадьбы и торжества',
          img: 'open-arm-line',
          childActive: false,
          child: [
            {
              name: 'Свадебные платья',
              id: 245,
            },
            {
              name: 'Вечерние платья',
              id: 246,
            },
            {
              name: 'Платья на выпускной',
              id: 247,
            },
            {
              name: 'Платье для свадебной вечеринки',
              id: 248,
            },
            {
              name: 'Свадебные аксессуары',
              id: 249,
            },
            {
              name: 'Коктейльные платья',
              id: 250,
            },
            {
              name: 'Платья подруги невесты',
              id: 251,
            },
            {
              name: 'Платья для матери невесты',
              id: 252,
            },
          ],
        },
        furniture: {
          title: 'Мебель',
          img: 'archive-drawer-line',
          childActive: false,
          child: [
            {
              name: 'Мебель для дома',
              id: 253,
            },
            {
              name: 'Офисная мебель',
              id: 254,
            },
            {
              name: 'Детская мебель',
              id: 255,
            },
            {
              name: 'Садовая мебель',
              id: 256,
            },
            {
              name: 'Производственная мебель',
              id: 257,
            },
            {
              name: 'Мебель для кофейни',
              id: 258,
            },
            {
              name: 'Мебель для бара',
              id: 259,
            },
            {
              name: 'Мебельные аксессуары',
              id: 260,
            },
            {
              name: 'Мебельная фурнитура',
              id: 261,
            },
            {
              name: 'Детали для мебели',
              id: 262,
            },
          ],
        },
        components: {
          title: 'Электронные компоненты и принадлежности',
          img: 'battery-2-charge-line',
          childActive: false,
          child: [
            {
              name: 'Активные компоненты',
              id: 263,
            },
            {
              name: 'Электротовары',
              id: 264,
            },
            {
              name: 'Электронные аксессуары и принадлежности',
              id: 265,
            },
            {
              name: 'Электронные системы данных',
              id: 266,
            },
            {
              name: 'Электронные знаки',
              id: 267,
            },
            {
              name: 'Оборудование для производства электроники',
              id: 268,
            },
            {
              name: 'Хранилища для электроники',
              id: 269,
            },
            {
              name: 'Оптоэлектронные дисплеи',
              id: 270,
            },
            {
              name: 'Прочие электронные компоненты',
              id: 271,
            },
            {
              name: 'Пассивные компоненты',
              id: 272,
            },
          ],
        },
        food: {
          title: 'Продукты',
          img: 'cake-3-line',
          childActive: false,
          child: [
            {
              name: 'Кофе',
              id: 273,
            },
            {
              name: 'Зерновые продукты',
              id: 274,
            },
            {
              name: 'Чай',
              id: 275,
            },
            {
              name: 'Орехи и зерна',
              id: 276,
            },
            {
              name: 'Бакалея',
              id: 277,
            },
            {
              name: 'Вода/соки/напитки',
              id: 278,
            },
            {
              name: 'Варенье и мёд',
              id: 279,
            },
            {
              name: 'Пищевые консервы',
              id: 280,
            },
            {
              name: 'Готовые блюда',
              id: 281,
            },
            {
              name: 'Фрукты и ягоды',
              id: 282,
            },
            {
              name: 'Овощи и зелень',
              id: 283,
            },
            {
              name: 'Молоко и яйца',
              id: 284,
            },
            {
              name: 'Хлеб и кондитерские изделия',
              id: 285,
            },
            {
              name: 'Сыр',
              id: 286,
            },
            {
              name: 'Колбасные изделия',
              id: 287,
            },
            {
              name: 'Мясо',
              id: 288,
            },
            {
              name: 'Рыба и морепродукты',
              id: 289,
            },
            {
              name: 'Замороженные продукты',
              id: 290,
            },
          ],
        },
        stationery: {
          title: 'Канцтовары для офиса и дома',
          img: 'pencil-ruler-2-line',
          childActive: false,
          child: [
            {
              name: 'Ручки, карандаши и письменные принадлежности',
              id: 291,
            },
            {
              name: 'Блокноты и записные книжки',
              id: 292,
            },
            {
              name: 'Товары для школы и обучения',
              id: 293,
            },
            {
              name: 'Товары для живописи',
              id: 294,
            },
            {
              name: 'Скотчи, клеи и зажимы',
              id: 295,
            },
            {
              name: 'Канцелярские наклейки',
              id: 296,
            },
            {
              name: 'Настольные аксессуары и органайзеры',
              id: 297,
            },
            {
              name: 'Офисные расходные принадлежности',
              id: 298,
            },
            {
              name: 'Этикетки, индексы и марки',
              id: 299,
            },
            {
              name: 'Бумага',
              id: 300,
            },
            {
              name: 'Календари, планировщики и карты',
              id: 301,
            },
            {
              name: 'Режущие приспособления',
              id: 302,
            },
            {
              name: 'Доски для презентаций',
              id: 303,
            },
            {
              name: 'Папки и файлы',
              id: 304,
            },
            {
              name: 'Принадлежности для почты и доставки',
              id: 305,
            },
            {
              name: 'Книги',
              id: 306,
            },
          ],
        },
        appliances: {
          title: 'Бытовая техника',
          img: 'fridge-line',
          childActive: false,
          child: [
            {
              name: 'Техника для кухни',
              id: 307,
            },
            {
              name: 'Техника для дома',
              id: 308,
            },
            {
              name: 'Техника для красоты',
              id: 309,
            },
            {
              name: 'Крупная бытовая техника',
              id: 310,
            },
            {
              name: 'Производственные принадлежности',
              id: 311,
            },
            {
              name: 'Запчасти для бытовой техники',
              id: 312,
            },
            {
              name: 'Техника для уборки',
              id: 313,
            },
          ],
        },
        improvement: {
          title: 'Обустройство дома',
          img: 'home-4-line',
          childActive: false,
          child: [
            {
              name: 'Лампы и освещение ',
              id: 314,
            },
            {
              name: 'Бытовая техника',
              id: 315,
            },
            {
              name: 'Сантехника',
              id: 316,
            },
            {
              name: 'Кухонные приспособления',
              id: 317,
            },
            {
              name: 'Оборудование',
              id: 318,
            },
            {
              name: 'Электрооборудование и материалы',
              id: 319,
            },
            {
              name: 'Строительные материалы',
              id: 320,
            },
            {
              name: 'Товары для покраски и подготовки стен',
              id: 321,
            },
            {
              name: 'Водопровод',
              id: 322,
            },
            {
              name: 'Интеллектуальная система для дома',
              id: 323,
            },
          ],
        },
        uniform: {
          title: 'Тематическая одежда и униформа',
          img: 't-shirt-line',
          childActive: false,
          child: [
            {
              name: 'Костюмы и аксессуары',
              id: 324,
            },
            {
              name: 'Экзотическая одежда',
              id: 325,
            },
            {
              name: 'Одежда для сцены и танцев',
              id: 326,
            },
            {
              name: 'Традиционная и этническая одежда',
              id: 327,
            },
            {
              name: 'Рабочая одежда и униформа',
              id: 328,
            },
          ],
        },
        wigs: {
          title: 'Шиньоны и парики',
          img: 'scissors-line',
          childActive: false,
          child: [
            {
              name: 'Плетения из человеческих волос',
              id: 329,
            },
            {
              name: 'Парики на кружеве',
              id: 330,
            },
            {
              name: 'Волосы для наращивания',
              id: 331,
            },
            {
              name: 'Сеть поставок в парикмахерские',
              id: 332,
            },
            {
              name: 'Синтетические парики',
              id: 333,
            },
            {
              name: 'Пряди волос',
              id: 334,
            },
            {
              name: 'Синтетические пряди',
              id: 335,
            },
            {
              name: 'Парики',
              id: 336,
            },
            {
              name: 'Инструменты и аксессуары',
              id: 337,
            },
            {
              name: 'Самодельные парики',
              id: 338,
            },
          ],
        },
        tools: {
          title: 'Инструменты',
          img: 'hammer-line',
          childActive: false,
          child: [
            {
              name: 'Инструменты для измерения и анализа',
              id: 339,
            },
            {
              name: 'Электрические инструменты',
              id: 340,
            },
            {
              name: 'Ручные инструменты',
              id: 341,
            },
            {
              name: 'Станки и комплектующие',
              id: 342,
            },
            {
              name: 'Наборы инструментов',
              id: 343,
            },
            {
              name: 'Сварочное оборудование',
              id: 344,
            },
            {
              name: 'Принадлежности для сварки и пайки',
              id: 345,
            },
            {
              name: 'Деревообрабатывающее оборудование и детали',
              id: 346,
            },
            {
              name: 'Детали инструментов',
              id: 347,
            },
            {
              name: 'Садовые инструменты',
              id: 348,
            },
            {
              name: 'Аксессуары для ручных и электроинструментов',
              id: 349,
            },
            {
              name: 'Абразивные инструменты',
              id: 350,
            },
            {
              name: 'Органайзеры для инструментов',
              id: 351,
            },
            {
              name: 'Строительные инструменты',
              id: 352,
            },
            {
              name: 'Пистолет для заклепок',
              id: 353,
            },
            {
              name: 'Инструменты и аксессуары для подъемника',
              id: 354,
            },
            {
              name: 'Абразивы',
              id: 355,
            },
          ],
        },
        security: {
          title: 'Безопасность и защита',
          img: 'shield-check-line',
          childActive: false,
          child: [
            {
              name: 'Видеонаблюдение',
              id: 356,
            },
            {
              name: 'Аварийный сигнал',
              id: 357,
            },
            {
              name: 'Контроль доступа',
              id: 358,
            },
            {
              name: 'Принадлежности для безопасности на рабочем месте',
              id: 359,
            },
            {
              name: 'Дверной домофон',
              id: 360,
            },
            {
              name: 'Принадлежности для самообороны',
              id: 361,
            },
            {
              name: 'Система смарт-карт',
              id: 362,
            },
            {
              name: 'Автоматизация зданий',
              id: 363,
            },
            {
              name: 'Противопожарная защита',
              id: 364,
            },
            {
              name: 'Аварийные наборы',
              id: 365,
            },
            {
              name: 'Защита дорожного полотна',
              id: 366,
            },
            {
              name: 'Сейфы',
              id: 367,
            },
            {
              name: 'Громоотвод',
              id: 368,
            },
            {
              name: 'Коробки передач и кабели',
              id: 369,
            },
            {
              name: 'Устройство проверки безопасности',
              id: 370,
            },
            {
              name: 'IoT-устройства',
              id: 371,
            },
            {
              name: 'Общественное вещание',
              id: 372,
            },
          ],
        },
        accessories: {
          title: 'Аксессуары для одежды',
          img: 'hand-coin-line',
          childActive: false,
          child: [
            {
              name: 'Женские очки',
              id: 373,
            },
            {
              name: 'Женские шапки',
              id: 374,
            },
            {
              name: 'Женские шарфы',
              id: 375,
            },
            {
              name: 'Женские аксессуары для волос',
              id: 376,
            },
            {
              name: 'Женские перчатки',
              id: 377,
            },
            {
              name: 'Женские ремни',
              id: 378,
            },
            {
              name: 'Женские аксессуары',
              id: 379,
            },
            {
              name: 'Мужские очки',
              id: 380,
            },
            {
              name: 'Мужские шапки',
              id: 381,
            },
            {
              name: 'Мужские шарфы',
              id: 382,
            },
            {
              name: 'Мужские ремни',
              id: 383,
            },
            {
              name: 'Мужские перчатки',
              id: 384,
            },
            {
              name: 'Мужские галстуки и носовые платки',
              id: 385,
            },
            {
              name: 'Мужские аксессуары',
              id: 386,
            },
            {
              name: 'Аксессуары для девочек',
              id: 387,
            },
            {
              name: 'Аксессуары для мальчиков',
              id: 388,
            },
            {
              name: 'Ткани и аксессуары',
              id: 389,
            },
          ],
        },
        digital: {
          title: 'Цифровые товары',
          img: 'bank-card-line',
          childActive: false,
          child: [
            {
              name: 'Подарочная карта',
              id: 390,
            },
            {
              name: 'Купоны',
              id: 391,
            },
            {
              name: 'Билеты',
              id: 392,
            },
            {
              name: 'ПО & Игры',
              id: 393,
            },
          ],
        },
        online: {
          title: 'Online услуги',
          img: 'global-line',
          childActive: false,
          child: [
            {
              name: 'консультации',
              id: 394,
            },
            {
              name: 'обучение',
              id: 395,
            },
            // {
            //   name: '',
            //   id: 396,
            // },
            // {
            //   name: '',
            //   id: 397,
            // },
            // {
            //   name: '',
            //   id: 398,
            // },
            // {
            //   name: '',
            //   id: 399,
            // },
            // {
            //   name: '',
            //   id: 400,
            // },
          ],
        },
      },
    };
  },
  watch: {
    arrowCatalog: {
      handler(val) {
        if (val === false) this.closeUp();
      },
    },
  },
  methods: {
    closeUp() {
      const arr = Object.keys(this.catalogList);
      arr.forEach((el) => { this.catalogList[el].childActive = false; });
    },
    changeChildActive(child) {
      //
      const changeValue = child;
      if (changeValue.childActive) {
        changeValue.childActive = !changeValue.childActive;
      } else {
        this.closeUp();
        changeValue.childActive = true;
      }
    },
    closeMobile() {
      if (window.innerWidth <= 980) {
        window.scrollTo(0, 0);
        this.$emit('catalog');
      }
    },
  },
};
</script>

<style lang="scss" scoped>
.arrow {
  position: relative;
  z-index: 5;
  &::after {
    content: '';
    position: absolute;
    mask: url('../assets/svg/Rectangle.svg') no-repeat;
    mask-size: cover;
    width: 16px;
    height: 16px;
  }
}
.line_grey {
  background-color: #E6E6E6;
  line-height: 40px;
  margin-bottom: 14px;
  border-radius: 20px;
  padding: 0 15px;
  cursor: pointer;
  &::after {
    transition: all 0.3s ease 0s;
    background-color: #fff;
    top: 12px;
    @media screen and (min-width: 981px) {
      right: 18px;
    }
  }
  @media screen and (max-width: 576px) {
    margin-bottom: 0;
  }
  &:hover {
    color: #7141F0;
    &::after {
      background-color: #7141F0;
    }
  }
}
.filter_body {
  padding: 0 15px;
  max-width: 283px;
  transition: 0.3s linear;
  @media screen and (max-width: 576px) {
    max-width: 100%;
  }
}
.filter_body_active {
    overflow: hidden;
    transition: 0.3s linear;
    z-index: -1;
    height: 100%;
}
.catalog {
  // position: relative;
  font-size: 15px;
}
.catalog_item {
  display: flex;
  flex-direction: column;
  text-align: center;
  min-height: 28px;
  transition: 0.3s linear;
  &_top {
    display: flex;
    &::after {
      transition: 0.3s linear;
      right: 3px;
      margin-top: -8px;
      top: 50%;
    }
    &:hover {
      transition: 0.3s linear;
      color: #7141F0;
      &::after {
        background-color: #7141F0;
      }
    }
    &_active {
      color: #7141F0;
      &::after {
        background-color: #7141F0;
        transition: 0.3s linear;
        transform: rotate(90deg);
      }
    }

  }
  &_bottom {
    display: flex;
    overflow: hidden;
    flex-direction: column;
    margin-bottom: 12px;
    max-height: 0;
    &_active {
      max-height: 10000px;
    }
  }
  img {
    width: 18px;
    height: 18px;
    margin: auto 0;
  }
  .catalog_text {
    padding-left: 12px;
    text-align: left;
    display: flex;
    margin: auto 0;
    flex-direction: column;
    cursor: pointer;

  }
  .catalog_child {
    text-align: left;
    margin-top: 12px;
    margin-left: 50px;
    &:hover {
      color: #7141F0;
      cursor: pointer;
    }
    label {
      cursor: pointer;
    }
    &_active {
      color: #7141F0;
      position: relative;
      &::before {
        content: '';
        background-color: #7141F0;
        width: 5px;
        height: 5px;
        border-radius: 50%;
        position: absolute;
        left: -18px;
        top: calc(50% - 3px);
      }
    }
  }
}
.catalog_bottom {
  overflow: hidden;

  z-index: 3;
  background-color: #fff;
  max-height: 0;
  transition: all 0.3s ease;
  @media screen and (max-width: 980px) {
    position: absolute;
  }
  @media screen and (max-width: 576px) {
    left: 0;
    width: 100%;
  }
  &_active {
    max-height: 10000px;
  }
}
.catalog_top {
  @media screen and (max-width: 980px) {
    background-color: #fff;
    cursor: pointer;
    &::after {
      transition: all 0.3s ease 0s;
      background-color: #CFCFCF;
      width: 9px;
      height: 9px;
      top: 15px;
      transform: rotate(90deg);
      margin-left: 9px;
    }
  }
}
.arrow_active {
  color: #7141F0;
  transition: all 0.3s ease 0s;
  &::after {
    transform: rotate(90deg);
    background-color: #7141F0;
    transition: all 0.3s ease 0s;
    @media screen and (max-width: 980px) {
      transform: rotate(-90deg);
    }
  }
}
</style>
